garyPenhook/PyAvrOCD/svd/attiny20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00800032</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Reset, Power-on Reset and Watchdog Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TIM1_CAPT</name>
        <description>Timer/Counter1 Input Capture</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIM1_COMPA</name>
        <description> Timer/Counter1 Compare Match A</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>TIM1_COMPB</name>
        <description> Timer/Counter1 Compare Match B</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIM1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIM0_COMPA</name>
        <description>Timer/Counter0 Compare Match A</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIM0_COMPB</name>
        <description>Timer/Counter0 Compare Match B</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIM0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>ANA_COMP</name>
        <description>Analog Comparator</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>ADC_ADC</name>
        <description>Conversion Complete</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TWI_SLAVE</name>
        <description>Two-Wire Interface</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SPI</name>
        <description>Serial Peripheral Interface</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>QTRIP</name>
        <description>Touch Sensing</description>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <name>CCP</name>
          <description>Configuration Change Protection</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CLKMSR</name>
          <description>Clock Main Settings Register</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKMS</name>
              <description>Clock Main Select Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKPSR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC noise reduction</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power-down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODS</name>
              <description>BOD Sleep</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCMD</name>
          <description>Non-Volatile Memory Command</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>NVMCSR</name>
          <description>Non-Volatile Memory Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NVMBSY</name>
              <description>Non-Volatile Memory Busy</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI</name>
              <description>Power Reduction Serial Peripheral Interface</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTWI</name>
              <description>Power Reduction TWI</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTFLR</name>
          <description>Reset Flag Register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on Reset Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP</name>
          <description>Stack Pointer </description>
          <addressOffset>0xB</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SREG</name>
          <description>Status Register</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C</name>
              <description>Carry Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Z</name>
              <description>Zero Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>N</name>
              <description>Negative Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>V</name>
              <description>Two's Complement Overflow Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Sign Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>Half Carry Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T</name>
              <description>Bit Copy Storage</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>Global Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
